--[[ 
     _        BY:@Aaa1R                     
  __| |_ __ __ _  __ _  ___  _ __  
 / _` | '__/ _` |/ _` |/ _ \| '_ \ 
| (_| | | | (_| | (_| | (_) | | | |
 \__,_|_|  \__,_|\__, |\___/|_| |_|
                 |___/             
--]]
do 

local function Memo(msg, matches) 
 local sudo = 283221766
 local r = get_receiver(msg)
  send_large_msg(r, "انــــتــظــــر كــــبــد 😻عــــمــــريــ😽هــــســــه🏃يــــجــــي 🚶مــــطــــوريــ راكــــب🙀عل تــنــيــن🐉😻🙊")
  send_large_msg("user#id"..sudo, "📝 لــك🙊تــاج👑مــــخــــي🐉يــــردوك طــــيــاره✈️\n\n ".."  مــــعــــرف مــــحــتــاجــك😻 : @"..msg.from.username.."\n 🆔 الايــــدي  : "..msg.from.id.."\n الاســــمــ🖊 الــــمــــجــــمــــوعــــه  : "..msg.to.title.."\n 🆔 الايــــدي الــــمــــجــــمــــوعــــه : "..msg.from.id..'\n الــــوقــــت⏳ : '..os.date(' %T*', os.time())..'\n📆 الــتــاريــخ  : '..os.date('!%A, %B %d, %Y*\n', timestamp))
end 

return { 
  patterns = { 
     "^(@Aaa1R)$" 
  }, 
  run = Memo, 
} 

end
-- BY Dev -ali dragon
