--[[ 
▀▄ ▄▀▀▄▄▀▀▄▄▀▀▄▄▀▀▄▄▀▀▄▄▀▀▄▄▀▀▄▀▄▄▀▀▄▄▀▀▄▄▀▀▄▄▀▀          
▀▄ ▄▀                                       ▀▄ ▄▀ 
▀▄ ▄▀       BY ali dragon                   ▀▄ ▄▀ 
▀▄ ▄▀ BY ali dragon (@Aaa1R)                ▀▄ ▄▀          
▀▄ ▄▀ JUST WRITED BY ali dragon             ▀▄ ▄▀   
▀▄ ▄▀          dev   : dev                  ▀▄ ▄▀ 
▀▄▀▀▄▄▀▀▄▄▀▄▄▀▀▄▄▀▀▄▄▀▄▄▀▀▄▄▀▀▄▄▀▄▄▀▀▄▄▀▀▄▄▀▄▄▀▀
—]] 
do

function run(msg, matches)
return [[
االبوت الذي يعمل على مجوعات السوبر 🙊👇🏾

يعمل البوت على مجموعات سوبر تصل الى 5 k عضو 👇🏾

     ≪تم صنع البوت بواسطة المطور≫
                      『 💢-Đєⱴ:@llSNLL  』
                      
                      👇🏾 💢 👇🏾
                      
                ه👇🏾
                      
                      
                      

end

return {
description = "Shows bot q", 
usage = "spam Shows bot q",
patterns = {
"^(المطور)$",
},
run = run 
}
end
