--[[ 
    BY ADOLF_HITLER (@LL190LL)  BY:حسين محمد     BY ADOLF_HITLER    (@LLSNLL)     
--]]
do
function run(msg, matches)
  if matches[1] == "الاوامر" and is_momod(msg) then
    return "اهلا وسهلا بك 😻🎈 "..msg.from.first_name.."\n"
  .."  ".."\n"
  ..[[
💯اهلا بكم هناك 4 اوامر في البوت🤗
🔶🔻🔺🔻🔺🔻🔺🔷

🐉م1⃣ : لعرض اوامر الادمنيه و المدير😼

🐉م2⃣ : لعرض اوامر تخص المجموعه 😺

🐉م3⃣ : لعرض اوامر حمايه المجموعه 😾

🐉م4⃣ : لعرض اوامر المطورين 😽
]].."\n"
.."🔸------------------------🔸".."\n"
..'💯ɖєṽ🐉:@llSNll'..'\n'
..'💯.BOT : @MX313_bot'..'\n'
------------------

  elseif matches[1] == "م1" and is_momod(msg) then
    return "اهلا وسهلا بك 😻🎈 "..msg.from.first_name.."\n"
  .."  ".."\n"
  ..[[
  🔰 اوامر تـخص الادمنيـه و المـديـر 🔰
🔸--------------------------🔹

🔰 اوامر تـخص الادمنيـه و المـديـر 🔰
🔸--------------------------🔸

🔸رفع ادمن :- لرفع ادمن رد + معرف

🔸تنزيل ادمن :- لرفع ادمن رد + معرف

🔸رفع اداري:- لرفع اداري رد + معرف

🔸تنزيل اداري:- لرفع اداري رد + معرف

🔸حظر :- حظر عضو من المجموعه

🔸الغاء حظر :- الغاء الحظر عن عضو

🔸منع + الكلمه :- منع كلمه  

🔸الغاء منع + الكلمه :- الغاء منع كلمه 

🔸قائمه المنع:- اظهار الكلمات الممنوعه

🔸تنظيف قائمه المنع:- لمسح كل المنع

🔸ايدي :- عرض ايدي المجموعه
 
🔸ايدي بالرد :- عرض ايدي شخص 

🔸كتم :- لكتم عضو رد + معرف + ايدي

🔸المكتومين :- لعرض قائمه المكتومين
]].."\n"
.."🔸------------------------🔸".."\n"
..'💯ɖєṽ🐉: @llSNll'..'\n'
..'💯BOT : @MX313_bot'..'\n'
------------------


  elseif  matches[1] == "م2" and is_momod(msg) then 
    return "اهلا وسهلا بك 😻🎈 "..msg.from.first_name.."\n"
  .."  ".."\n"
  ..[[
🔶- اوامــر تــخــص  المـجـمـوعـه ♨️
|🕎| 🔺🔻🔺🔻🔺🔻|🕎|


|🎭| ضع ترحيب📜
|🎏|لوضع ترحيب في المجموعه📜

|🎭| ضع صوره🎠
|🎏| لوضع صوره ☑️🎠

|🎭| ضع قوانين📝
|🎏| لوضع قوانين ☑️📝

|🎭| ضع وصف🗒
|🎏| لوضع وصف  ☑️🗒

|🎭| ضع اسم🖊
|🎏| لوضع اسم  ☑️🖊

|🎭| ضع  معرف〽️
|🎏| لوضع معرف ☑️〽️

|🎭| ضع رابط🗃
|🎏| لخزن رابط المجموعه☑️🗃

|🎭| الرابط🗃
|🎏| لعرض رابط المجموعه 🗃📝

|🎭| معلوماتي📋
|🎏| لعرض معلوماتك📋〽️

|🎭| معلومات المجموعه📝
|🎏| لعرض معلومات المجموعه📝〽️

|🎭| اعدادت الوسائط✉️
|🎏| لاضهار الاعدادات الوسائط📩

|🕎| 🔺🔻🔺🔻🔺🔻|🕎|]].."\n"
.."🔸------------------------🔸".."\n"
..'💯ɖєṽ🐉:@llSNll'..'\n'
..'💯BOT : @MX313_bot'..'\n'
------------------

  elseif  matches[1] == "م3" and is_momod(msg) then 
    return "اهلا وسهلا بك 😻🎈 "..msg.from.first_name.."\n"
  .."  ".."\n"
  ..[[
  🔒 اوامـــر حمـــايه الـــمجمـــوعه 🔓
🔸------------------------🔸
قفل + الامر / للقفل 🔐
فتح + الامر / للفتح  🔓
🔸------------------------🔸

🔸الصوت|📣
🔸الصور المتحركه|🌅
🔸الصور|🗻
🔸الفديو|📽
🔸اعاده توجيه|↪️
🔸التكرار|📈
🔸البوتات|🤖
🔸الروابط|📥
🔸 المعرف|🌀
🔸 التاك|📥
🔸 الشارحه|〰

🔸الاضافه|🚸
🔸الاضافه الجماعية|⛎
🔸الاشعارات|🌀
🔸جهات اتصال|💢
🔸الكلايش|📝
🔸الدردشه|🗣
🔸العربيه|✳️
🔸 الانلاين|📡
🔸 الدخول بالرابط|📍
🔸 السمايل|😃
  ]].."\n"
.."🔸------------------------🔸".."\n"
..'💯ɖєṽ🐉:@llSNll'..'\n'
..'💯BOT : @MX313_bot'..'\n'
------------------
  elseif  matches[1] == "م4" and is_owner(msg) then 
    return "اهلا وسهلا بك 😻🎈 "..msg.from.first_name.."\n"
  .."  ".."\n"
  ..[[
🔧 اوامـــر المــطـــوريـــن  🛠
|🕎| 🔺🔻🔺🔻🔺🔻 |🕎|
|🕹| تفعيل 💯☑️
|⛏| لتفعيل البوت بالمجموعه 💯🆎

|🕹| تعطيل 🚫
|⛏| لتعطيل البوت بالمجموعه ⚠️🚫
|🕹| رفع المدير 👤
|⛏| لرفع المدير عن طريق الرد + معرف  〽️
|🕹| وضع وقت + عدد الايام📋
|🖲| لتفعيل البوت ع عدد الايام🆎⏳
|🕹| الوقت⏳
|⛏| لمعرفت عدد ايام تفعيل البوت🛠
|🕹| اذاعه ☢
|⛏| لنشر شئ بكل مجموعات البوت ➿

|🕹| زحلك 🏄🏻
|⛏| لطرد البوت من المجموعه 🆎🏄🏻
|🕹| جلب ملف + اسم الملف  🖊🗂  
|⛏| لجلب ملف من سيرفر البوت ➿
|🕹| تفعيل + اسم الملف 🖊🗂
|⛏| لتفعيل ملف عن طريق البوت🆎

|🖲| تعطيل + اسم للملف📁
|🕹| لتعطيل ملف عن طريق البوت🆎
|🖲| صنع مجموعه + الاسم 🖊
|🕹| لصنع مجموعه بواسطه حساب البوت🆎
|🖲| ترقيه سوبر  ♻️
|🕹| لترقيه المجموعه بواسطه حساب البوت🆎
|🕹| ريديس : لتعديل عمل البوت🆎 
|🖲| حدث  : لتحديث البوت🆎
|🕎| 🔺🔻🔺🔻🔺🔻|🕎|  ]].."\n"
.."🔸------------------------🔸".."\n"
..'💯ɖєṽ🐉:@llSNll'..'\n'
..'💯BOT : @MX313_bot'..'\n'
  end
end
return {
  patterns = {
    "^(الاوامر)",
    "^(م1)",
    "^(م2)",
    "^(م3)",
    "^(م4)",

  },
  run = run
}
end



